; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-62)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 - object)
 (:init 
    (arm-empty)
    (clear b13)
    (on b13 b17)
    (on b17 b8)
    (on-table b8)
    (clear b1)
    (on b1 b12)
    (on b12 b11)
    (on b11 b10)
    (on b10 b16)
    (on-table b16)
    (clear b4)
    (on b4 b15)
    (on b15 b7)
    (on b7 b18)
    (on b18 b2)
    (on b2 b14)
    (on b14 b6)
    (on b6 b5)
    (on b5 b9)
    (on b9 b3)
    (on-table b3))
 (:goal (and 
(on b10 b13)
))
)

; plan
1. (unstack b1 b12)
   deleted: (on b1 b12) (clear b1) (arm-empty)
   added: (holding b1) (clear b12)
   goals met: 0 of 1
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 1
3. (unstack b12 b11)
   deleted: (on b12 b11) (clear b12) (arm-empty)
   added: (holding b12) (clear b11)
   goals met: 0 of 1
4. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 1
5. (unstack b11 b10)
   deleted: (on b11 b10) (clear b11) (arm-empty)
   added: (holding b11) (clear b10)
   goals met: 0 of 1
6. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 1
7. (unstack b10 b16)
   deleted: (on b10 b16) (clear b10) (arm-empty)
   added: (holding b10) (clear b16)
   goals met: 0 of 1
8. (stack b10 b13)
   deleted: (clear b13) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b13)
   goals met: 1 of 1
